/*
**********  Sixth task on C++ course                                         ****
**********  Filename >main.cpp                                               ****
**********  IDE > QT Creator 4.13.2||CodeBlocks 20.03 + GCC 10.2.0           ****
**********  Created by > "~ORDA~" , Anton Bondarenko                         ****
**********  Date 31.04.2021                                                  ****
*/



//DONE● Выделить в памяти динамический одномерный массив типа int. Размер массива запросить у пользователя. Инициализировать его числами степенями двойки: 1, 2, 4, 8, 16, 32, 64, 128 … Вывести массив на экран. Не забыть освободить память. =) Разбить программу на функции.
//DONE+-/ функционал нужно разделить, вызвает зависание  Динамически выделить матрицу 4х4 типа int. Инициализировать ее псевдослучайными числами через функцию rand. Вывести на экран.
//                                                       Разбейте вашу программу на функции которые вызываются из main.
//DONE● Написать программу c 2-я функциями, которая создаст два текстовых файла (*.txt), примерно по 50-100 символов в каждом (особого значения не имеет с каким именно содержимым). Имена файлов запросить у польлзователя.
//DONE●* Написать функцию, «склеивающую» эти файлы в третий текстовый файл (имя файлов спросить у пользователя).
//* Написать программу, которая проверяет присутствует ли указанное пользователем при запуске программы слово в указанном пользователем файле (для простоты работаем только с латиницей).





//#include <QCoreApplication>
#include <main.h>
//extern string resol;

using namespace std;

int main()
{
  int task1_m_size;
  int *task1_m;

  const size_t task2_m_size1=4;
  const size_t task2_m_size2=4;
  int **task2_m;
  char f_name1[64];
  char f_name2[64];
  char f_name3[64];
  char f_name[64];
  char f_search[64];



  //*************************************************************************************************
  cout <<"1St task in process\n";

  cout <<" please enter arr size better in range 0.....31  : ";
  cin>> task1_m_size;
  Task1_func( task1_m , task1_m_size);
  //*************************************************************************************************

  //*************************************************************************************************
  cout <<"2ND task in process\n";

  Task2_func(task2_m, task2_m_size1, task2_m_size2);
  //*************************************************************************************************
  cout <<"3RD task in process\n";
  cout <<"Please enter 1st file name : ";
  cin>>f_name1;
  Task3_func1(f_name1);
  cout <<"Please enter 2nd file name : ";
  cin>>f_name2;
  Task3_func2(f_name2);


 //*************************************************************************************************
 cout <<"\n4TH task in process\n";
 cout <<"Please enter result file name : ";
 cin>>f_name3;
 Task4_func(f_name1,f_name2,f_name3);
 //*************************************************************************************************
 cout <<"\n5TH task in process\n";
 cout <<"Please enter rfile name for checking :";
 cin>>f_name;
 cout <<"Please enter what we want to find :";
 cin>>f_search;
 Task5_func(f_name,f_search);
    return 0;
}
